In [1]:
# Import acreate Engine package
import sqlalchemy
sqlalchemy.__version__

'1.2.7'

In [2]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:', echo=True)

In [3]:
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

In [4]:
from sqlalchemy import Table, Column, Integer, String
from sqlalchemy import Sequence

class Adult(Base):
     __tablename__ = 'adults'
     id = Column(Integer, Sequence('adult_id_seq'), primary_key=True)
     age = Column(Integer)
     workclass = Column(String)
     fnlwgt  = Column(Integer)
     education = Column(String)
     educationnum = Column(Integer)
     maritalstatus = Column(String)
     occupation = Column(String)
     relationship       = Column(String)
     race              = Column(String)
     sex              = Column(String)
     capitalgain    = Column(Integer)
     capitalloss     = Column(Integer)
     hoursperweek  = Column(Integer)
     nativecountry   = Column(String)
     classname = Column(String)

In [5]:
 Adult.__table__

Table('adults', MetaData(bind=None), Column('id', Integer(), table=<adults>, primary_key=True, nullable=False, default=Sequence('adult_id_seq', metadata=MetaData(bind=None))), Column('age', Integer(), table=<adults>), Column('workclass', String(), table=<adults>), Column('fnlwgt', Integer(), table=<adults>), Column('education', String(), table=<adults>), Column('educationnum', Integer(), table=<adults>), Column('maritalstatus', String(), table=<adults>), Column('occupation', String(), table=<adults>), Column('relationship', String(), table=<adults>), Column('race', String(), table=<adults>), Column('sex', String(), table=<adults>), Column('capitalgain', Integer(), table=<adults>), Column('capitalloss', Integer(), table=<adults>), Column('hoursperweek', Integer(), table=<adults>), Column('nativecountry', String(), table=<adults>), Column('classname', String(), table=<adults>), schema=None)

In [6]:
Base.metadata.create_all(engine)

2018-10-07 15:53:26,204 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2018-10-07 15:53:26,215 INFO sqlalchemy.engine.base.Engine ()
2018-10-07 15:53:26,217 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2018-10-07 15:53:26,219 INFO sqlalchemy.engine.base.Engine ()
2018-10-07 15:53:26,221 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("adults")
2018-10-07 15:53:26,232 INFO sqlalchemy.engine.base.Engine ()
2018-10-07 15:53:26,235 INFO sqlalchemy.engine.base.Engine
CREATE TABLE adults (
	id INTEGER NOT NULL,
	age INTEGER,
	workclass VARCHAR,
	fnlwgt INTEGER,
	education VARCHAR,
	educationnum INTEGER,
	maritalstatus VARCHAR,
	occupation VARCHAR,
	relationship VARCHAR,
	race VARCHAR,
	sex VARCHAR,
	capitalgain INTEGER,
	capitalloss INTEGER,
	hoursperweek INTEGER,
	nativecountry VARCHAR,
	classname VARCHAR,
	PRIMARY KEY (id)
)


2018-10-07 15:53:26,236 INFO sqlalchemy.engine.base.Engine ()
2018-10-07 15:53:26,237 INFO sqlalchemy.engine.base.Engine COMMIT

In [7]:
# Read the data from the given URL and see the top 5 records
import pandas as pd
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')

# Rename the columns as per the description.
df.columns = ['age', 'workclass', 'fnlwgt', 'education', 'educationnum', 'maritalstatus', 'occupation', 'relationship' ,'race', 'sex' , 'capitalgain', 'capitalloss' , 'hoursperweek', 'nativecountry','classname' ]    
df = df.infer_objects()

df_new = pd.DataFrame(df)

In [8]:
df_new.info()
df_new.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32560 entries, 0 to 32559
Data columns (total 15 columns):
age              32560 non-null int64
workclass        32560 non-null object
fnlwgt           32560 non-null int64
education        32560 non-null object
educationnum     32560 non-null int64
maritalstatus    32560 non-null object
occupation       32560 non-null object
relationship     32560 non-null object
race             32560 non-null object
sex              32560 non-null object
capitalgain      32560 non-null int64
capitalloss      32560 non-null int64
hoursperweek     32560 non-null int64
nativecountry    32560 non-null object
classname        32560 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

,age,workclass,fnlwgt,education,educationnum,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,nativecountry,classname
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [9]:
from sqlalchemy.orm import sessionmaker
Session = sessionmaker(bind=engine)
session = Session()

In [10]:
adult = Adult( age = 50, workclass = 'Private' , fnlwgt = 83311, education ='Bachelors', educationnum = 13, maritalstatus = 'Married-civ-spouse', occupation ='Exec-managerial' , relationship = 'Husband', race = 'White', sex = 'Male', capitalgain =10000, capitalloss = 0, hoursperweek = 40, nativecountry = 'India', classname = '<=50K')
session.add(adult)

adult = Adult( age = 40, workclass = 'Self-emp-not-inc', fnlwgt = 215646, education ='Masters', educationnum = 14, maritalstatus = 'Married-civ-spouse', occupation ='Exec-managerial' , relationship = 'Husband', race = 'White', sex = 'Male', capitalgain =10000, capitalloss = 0, hoursperweek = 50, nativecountry = 'USA', classname = '<=50K')
session.add(adult)

adult = Adult( age = 0, workclass = 'Self-emp-not-inc', fnlwgt = 215646, education ='Masters', educationnum = 14, maritalstatus = 'Married-civ-spouse', occupation ='Exec-managerial' , relationship = 'Husband', race = 'White', sex = 'Male', capitalgain =10000, capitalloss = 0, hoursperweek = 60, nativecountry = 'SWEDAN', classname = '<=50K')
session.add(adult)

adult = Adult( age = 10, workclass = 'Self-emp-not-inc', fnlwgt = 215646, education ='Masters', educationnum = 14, maritalstatus = 'Married-civ-spouse', occupation ='Exec-managerial' , relationship = 'Husband', race = 'White', sex = 'Male', capitalgain =10000, capitalloss = 0, hoursperweek = 70, nativecountry = 'FRANCE', classname = '<=50K')
session.add(adult)

In [11]:
for instance in session.query(Adult).order_by(Adult.id):
     print(instance.age, instance.workclass, instance.nativecountry, instance.education)

2018-10-07 15:53:37,729 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2018-10-07 15:53:37,731 INFO sqlalchemy.engine.base.Engine INSERT INTO adults (age, workclass, fnlwgt, education, educationnum, maritalstatus, occupation, relationship, race, sex, capitalgain, capitalloss, hoursperweek, nativecountry, classname) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2018-10-07 15:53:37,732 INFO sqlalchemy.engine.base.Engine (50, 'Private', 83311, 'Bachelors', 13, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 10000, 0, 40, 'India', '<=50K')
2018-10-07 15:53:37,733 INFO sqlalchemy.engine.base.Engine INSERT INTO adults (age, workclass, fnlwgt, education, educationnum, maritalstatus, occupation, relationship, race, sex, capitalgain, capitalloss, hoursperweek, nativecountry, classname) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2018-10-07 15:53:37,734 INFO sqlalchemy.engine.base.Engine (40, 'Self-emp-not-inc', 215646, 'Masters', 14, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 10000, 0, 50, 'USA', '<=50K')
2018-10-07 15:53:37,735 INFO sqlalchemy.engine.base.Engine INSERT INTO adults (age, workclass, fnlwgt, education, educationnum, maritalstatus, occupation, relationship, race, sex, capitalgain, capitalloss, hoursperweek, nativecountry, classname) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2018-10-07 15:53:37,736 INFO sqlalchemy.engine.base.Engine (0, 'Self-emp-not-inc', 215646, 'Masters', 14, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 10000, 0, 60, 'SWEDAN', '<=50K')
2018-10-07 15:53:37,737 INFO sqlalchemy.engine.base.Engine INSERT INTO adults (age, workclass, fnlwgt, education, educationnum, maritalstatus, occupation, relationship, race, sex, capitalgain, capitalloss, hoursperweek, nativecountry, classname) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2018-10-07 15:53:37,738 INFO sqlalchemy.engine.base.Engine (10, 'Self-emp-not-inc', 215646, 'Masters', 14, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 10000, 0, 70, 'FRANCE', '<=50K')
2018-10-07 15:53:37,741 INFO sqlalchemy.engine.base.Engine SELECT adults.id AS adults_id, adults.age AS adults_age, adults.workclass AS adults_workclass, adults.fnlwgt AS adults_fnlwgt, adults.education AS adults_education, adults.educationnum AS adults_educationnum, adults.maritalstatus AS adults_maritalstatus, adults.occupation AS adults_occupation, adults.relationship AS adults_relationship, adults.race AS adults_race, adults.sex AS adults_sex, adults.capitalgain AS adults_capitalgain, adults.capitalloss AS adults_capitalloss, adults.hoursperweek AS adults_hoursperweek, adults.nativecountry AS adults_nativecountry, adults.classname AS adults_classname
FROM adults ORDER BY adults.id
2018-10-07 15:53:37,742 INFO sqlalchemy.engine.base.Engine ()
50 Private India Bachelors
40 Self-emp-not-inc USA Masters
0 Self-emp-not-inc SWEDAN Masters
10 Self-emp-not-inc FRANCE Masters

In [12]:
# 2. Write two basic update queries
adult_usa = session.query(Adult).filter_by(nativecountry='USA').first() 
adult_usa.nativecountry ='India'
adult_usa.education ='PHD'

for instance in session.query(Adult).order_by(Adult.id):
    print(instance.age, instance.workclass, instance.nativecountry, instance.education)

2018-10-07 15:53:37,753 INFO sqlalchemy.engine.base.Engine SELECT adults.id AS adults_id, adults.age AS adults_age, adults.workclass AS adults_workclass, adults.fnlwgt AS adults_fnlwgt, adults.education AS adults_education, adults.educationnum AS adults_educationnum, adults.maritalstatus AS adults_maritalstatus, adults.occupation AS adults_occupation, adults.relationship AS adults_relationship, adults.race AS adults_race, adults.sex AS adults_sex, adults.capitalgain AS adults_capitalgain, adults.capitalloss AS adults_capitalloss, adults.hoursperweek AS adults_hoursperweek, adults.nativecountry AS adults_nativecountry, adults.classname AS adults_classname
FROM adults
WHERE adults.nativecountry = ?
 LIMIT ? OFFSET ?
2018-10-07 15:53:37,755 INFO sqlalchemy.engine.base.Engine ('USA', 1, 0)
2018-10-07 15:53:37,760 INFO sqlalchemy.engine.base.Engine UPDATE adults SET education=?, nativecountry=? WHERE adults.id = ?
2018-10-07 15:53:37,762 INFO sqlalchemy.engine.base.Engine ('PHD', 'India', 2)
2018-10-07 15:53:37,764 INFO sqlalchemy.engine.base.Engine SELECT adults.id AS adults_id, adults.age AS adults_age, adults.workclass AS adults_workclass, adults.fnlwgt AS adults_fnlwgt, adults.education AS adults_education, adults.educationnum AS adults_educationnum, adults.maritalstatus AS adults_maritalstatus, adults.occupation AS adults_occupation, adults.relationship AS adults_relationship, adults.race AS adults_race, adults.sex AS adults_sex, adults.capitalgain AS adults_capitalgain, adults.capitalloss AS adults_capitalloss, adults.hoursperweek AS adults_hoursperweek, adults.nativecountry AS adults_nativecountry, adults.classname AS adults_classname
FROM adults ORDER BY adults.id
2018-10-07 15:53:37,765 INFO sqlalchemy.engine.base.Engine ()
50 Private India Bachelors
40 Self-emp-not-inc India PHD
0 Self-emp-not-inc SWEDAN Masters
10 Self-emp-not-inc FRANCE Masters

In [13]:
# 3. Write two delete queries
adult_delete = session.query(Adult).filter_by(nativecountry='SWEDAN').one()
session.delete(adult_delete)
session.commit()

2018-10-07 15:53:37,777 INFO sqlalchemy.engine.base.Engine SELECT adults.id AS adults_id, adults.age AS adults_age, adults.workclass AS adults_workclass, adults.fnlwgt AS adults_fnlwgt, adults.education AS adults_education, adults.educationnum AS adults_educationnum, adults.maritalstatus AS adults_maritalstatus, adults.occupation AS adults_occupation, adults.relationship AS adults_relationship, adults.race AS adults_race, adults.sex AS adults_sex, adults.capitalgain AS adults_capitalgain, adults.capitalloss AS adults_capitalloss, adults.hoursperweek AS adults_hoursperweek, adults.nativecountry AS adults_nativecountry, adults.classname AS adults_classname
FROM adults
WHERE adults.nativecountry = ?
2018-10-07 15:53:37,779 INFO sqlalchemy.engine.base.Engine ('SWEDAN',)
2018-10-07 15:53:37,782 INFO sqlalchemy.engine.base.Engine DELETE FROM adults WHERE adults.id = ?
2018-10-07 15:53:37,783 INFO sqlalchemy.engine.base.Engine (3,)
2018-10-07 15:53:37,784 INFO sqlalchemy.engine.base.Engine COMMIT

In [14]:
adult_delete = session.query(Adult).filter_by(hoursperweek=40).one()
session.delete(adult_delete)
session.commit()

2018-10-07 15:53:37,792 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2018-10-07 15:53:37,795 INFO sqlalchemy.engine.base.Engine SELECT adults.id AS adults_id, adults.age AS adults_age, adults.workclass AS adults_workclass, adults.fnlwgt AS adults_fnlwgt, adults.education AS adults_education, adults.educationnum AS adults_educationnum, adults.maritalstatus AS adults_maritalstatus, adults.occupation AS adults_occupation, adults.relationship AS adults_relationship, adults.race AS adults_race, adults.sex AS adults_sex, adults.capitalgain AS adults_capitalgain, adults.capitalloss AS adults_capitalloss, adults.hoursperweek AS adults_hoursperweek, adults.nativecountry AS adults_nativecountry, adults.classname AS adults_classname
FROM adults
WHERE adults.hoursperweek = ?
2018-10-07 15:53:37,796 INFO sqlalchemy.engine.base.Engine (40,)
2018-10-07 15:53:37,798 INFO sqlalchemy.engine.base.Engine DELETE FROM adults WHERE adults.id = ?
2018-10-07 15:53:37,799 INFO sqlalchemy.engine.base.Engine (1,)
2018-10-07 15:53:37,801 INFO sqlalchemy.engine.base.Engine COMMIT

In [15]:
for instance in session.query(Adult).order_by(Adult.id):
    print(instance.age, instance.workclass, instance.nativecountry, instance.education)

2018-10-07 15:53:37,813 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2018-10-07 15:53:37,816 INFO sqlalchemy.engine.base.Engine SELECT adults.id AS adults_id, adults.age AS adults_age, adults.workclass AS adults_workclass, adults.fnlwgt AS adults_fnlwgt, adults.education AS adults_education, adults.educationnum AS adults_educationnum, adults.maritalstatus AS adults_maritalstatus, adults.occupation AS adults_occupation, adults.relationship AS adults_relationship, adults.race AS adults_race, adults.sex AS adults_sex, adults.capitalgain AS adults_capitalgain, adults.capitalloss AS adults_capitalloss, adults.hoursperweek AS adults_hoursperweek, adults.nativecountry AS adults_nativecountry, adults.classname AS adults_classname
FROM adults ORDER BY adults.id
2018-10-07 15:53:37,818 INFO sqlalchemy.engine.base.Engine ()
40 Self-emp-not-inc India PHD
10 Self-emp-not-inc FRANCE Masters

In [16]:
#4. Write two filter queries
adult = Adult( age = 10, workclass = 'Self-emp-not-inc', fnlwgt = 215646, education ='Masters', educationnum = 14, maritalstatus = 'Married-civ-spouse', occupation ='Exec-managerial' , relationship = 'Husband', race = 'White', sex = 'Male', capitalgain =10000, capitalloss = 0, hoursperweek = 70, nativecountry = 'FRANCE', classname = '<=50K')
session.add(adult)

for instance in session.query(Adult).filter_by(nativecountry = 'India'):
    print(instance.age, instance.workclass, instance.nativecountry, instance.education)

2018-10-07 15:53:37,833 INFO sqlalchemy.engine.base.Engine INSERT INTO adults (age, workclass, fnlwgt, education, educationnum, maritalstatus, occupation, relationship, race, sex, capitalgain, capitalloss, hoursperweek, nativecountry, classname) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2018-10-07 15:53:37,834 INFO sqlalchemy.engine.base.Engine (10, 'Self-emp-not-inc', 215646, 'Masters', 14, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 10000, 0, 70, 'FRANCE', '<=50K')
2018-10-07 15:53:37,837 INFO sqlalchemy.engine.base.Engine SELECT adults.id AS adults_id, adults.age AS adults_age, adults.workclass AS adults_workclass, adults.fnlwgt AS adults_fnlwgt, adults.education AS adults_education, adults.educationnum AS adults_educationnum, adults.maritalstatus AS adults_maritalstatus, adults.occupation AS adults_occupation, adults.relationship AS adults_relationship, adults.race AS adults_race, adults.sex AS adults_sex, adults.capitalgain AS adults_capitalgain, adults.capitalloss AS adults_capitalloss, adults.hoursperweek AS adults_hoursperweek, adults.nativecountry AS adults_nativecountry, adults.classname AS adults_classname
FROM adults
WHERE adults.nativecountry = ?
2018-10-07 15:53:37,838 INFO sqlalchemy.engine.base.Engine ('India',)
40 Self-emp-not-inc India PHD

In [17]:
#%.Write two function queries
from sqlalchemy import func
session.query(func.count(Adult.id)).scalar()

2018-10-07 15:53:37,851 INFO sqlalchemy.engine.base.Engine SELECT count(adults.id) AS count_1
FROM adults
2018-10-07 15:53:37,854 INFO sqlalchemy.engine.base.Engine ()

3

In [18]:
adult = Adult( age =30, workclass = 'Self-emp-not-inc', fnlwgt = 215646, education ='Masters', educationnum = 14, maritalstatus = 'Married-civ-spouse', occupation ='Exec-managerial' , relationship = 'Husband', race = 'White', sex = 'Male', capitalgain =10000, capitalloss = 0, hoursperweek = 70, nativecountry = 'India', classname = '<=50K')
session.add(adult)
session.query(func.count(Adult.nativecountry), Adult.nativecountry).group_by(Adult.nativecountry).all()

2018-10-07 15:53:37,870 INFO sqlalchemy.engine.base.Engine INSERT INTO adults (age, workclass, fnlwgt, education, educationnum, maritalstatus, occupation, relationship, race, sex, capitalgain, capitalloss, hoursperweek, nativecountry, classname) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2018-10-07 15:53:37,873 INFO sqlalchemy.engine.base.Engine (30, 'Self-emp-not-inc', 215646, 'Masters', 14, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 10000, 0, 70, 'India', '<=50K')
2018-10-07 15:53:37,879 INFO sqlalchemy.engine.base.Engine SELECT count(adults.nativecountry) AS count_1, adults.nativecountry AS adults_nativecountry
FROM adults GROUP BY adults.nativecountry
2018-10-07 15:53:37,880 INFO sqlalchemy.engine.base.Engine ()

[(2, 'FRANCE'), (2, 'India')]